# Taps
tap 'homebrew/cask-fonts'

## Shell Utilities
brew 'ack'
brew 'tmux'
brew 'starship'
brew 'fish'

## Network Utilities
brew 'htop'
brew 'wget'

## System Utilities
brew 'tree'
brew 'trash'
brew 'koekeishiya/formulae/khd'
brew 'cocoapods

## Dev Utilities
brew 'git'
brew 'gh'
brew 'fisher'
brew 'diff-so-fancy'
brew 'jenv'
cask 'firefox'
cask 'iterm2'
cask 'webstorm'

# Mac Apps
## Communication
cask 'slack'
cask 'spotify'
cask 'whatsapp'
cask 'discord'

## Productivity
cask 'figma'
cask 'google-chrome'
cask 'notion'

## System
cask 'the-unarchiver'
cask 'visual-studio-code'

# Fonts
cask 'font-fira-code-nerd-font'
